{"PartitionKey":"CATemplate","RowKey":"e858852b-ea83-4df9-9359-c6315ee7f1f0","GUID":"e858852b-ea83-4df9-9359-c6315ee7f1f0","JSON":"{\"id\":\"ee460894-1e8e-4766-b541-643ab0ed8b2e\",\"displayName\":\"CAPB001-Require MFA for All Users\",\"createdDateTime\":\"2024-12-12T03:04:35.9291386Z\",\"modifiedDateTime\":\"2025-05-12T16:28:58.7571056Z\",\"state\":\"enabled\",\"conditions\":{\"userRiskLevels\":[],\"signInRiskLevels\":[],\"clientAppTypes\":[\"all\"],\"platforms\":null,\"locations\":null,\"times\":null,\"deviceStates\":null,\"devices\":null,\"clientApplications\":null,\"applications\":{\"includeApplications\":[\"All\"],\"excludeApplications\":[],\"includeUserActions\":[],\"includeAuthenticationContextClassReferences\":[],\"applicationFilter\":null},\"users\":{\"includeUsers\":[\"All\"],\"excludeUsers\":[],\"includeGroups\":[],\"excludeGroups\":[\"CAP-EXCLUSION-GRP\"],\"includeRoles\":[],\"excludeRoles\":[],\"includeGuestsOrExternalUsers\":null,\"excludeGuestsOrExternalUsers\":{\"guestOrExternalUserTypes\":\"serviceProvider\",\"externalTenants\":{\"@odata.type\":\"#microsoft.graph.conditionalAccessAllExternalTenants\",\"membershipKind\":\"all\"}}}},\"grantControls\":{\"operator\":\"OR\",\"builtInControls\":[\"mfa\"],\"customAuthenticationFactors\":[],\"termsOfUse\":[],\"authenticationStrength@odata.context\":\"https://graph.microsoft.com/beta/$metadata#conditionalAccess/policies('ee460894-1e8e-4766-b541-643ab0ed8b2e')/grantControls/authenticationStrength/$entity\",\"authenticationStrength\":null},\"sessionControls\":{\"disableResilienceDefaults\":null,\"applicationEnforcedRestrictions\":null,\"cloudAppSecurity\":null,\"persistentBrowser\":null,\"continuousAccessEvaluation\":null,\"secureSignInSession\":null,\"signInFrequency\":{\"value\":14,\"type\":\"days\",\"authenticationType\":\"primaryAndSecondaryAuthentication\",\"frequencyInterval\":\"timeBased\",\"isEnabled\":true}},\"LocationInfo\":[null,null]}"}